app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    if flash[:success] != nil
      flash[:success]
    end

    if params[:user_id] != nil
      @user = User.find(params[:user_id])

UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "New Name"], ["email", "new@example.com"], ["password_digest", "$2a$04$fHDDzbTm4a6V62e53sw2K.pgkQpxcZNzQHpzAg56SGeaEjdohO7Oi"], ["updated_at", Sun, 13 Apr 2014 21:43:26 UTC +00:00]]
---
  def update
    if @user.update_attributes(user_params)